Практика1/src/Documents/Лимиты/Лимиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Лимиты</name>
  <registerRecords>InformationRegister.СемейныйБюджет</registerRecords>
  <attributes>
    <name>ЧленСемьи</name>
    <type>
      <types>CatalogRef.УчастникиСемьи</types>
    </type>
  </attributes>
  <attributes>
    <name>Лимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Практика1/src/InformationRegisters/СемейныйБюджет/СемейныйБюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СемейныйБюджет</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДоступныеСредства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛимитРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЧленСемьи</name>
    <type>
      <types>CatalogRef.УчастникиСемьи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Практика1/src/Documents/Лимиты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕжедневныеРасходыОстатки.СуммаРасходовОстаток) КАК СуммаРасходовОстаток
		|ИЗ
		|	РегистрНакопления.ЕжедневныеРасходы.Остатки КАК ЕжедневныеРасходыОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ОстатокДенег = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОстатокДенег = ВыборкаДетальныеЗаписи.СуммаРасходовОстаток;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	// регистр СемейныйБюджет
	Движения.СемейныйБюджет.Записывать = Истина;
	Движение = Движения.СемейныйБюджет.Добавить();
	Движение.Период = Дата;
	Движение.ЧленСемьи = ЧленСемьи;
	Движение.Месяц = Формат(Дата, "ДФ=ММММ");
	Движение.Год = Формат(Дата, "ДФ=yyyy");
	Движение.ДоступныеСредства = ОстатокДенег;
	Движение.ЛимитРасходов = Лимит;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
